#Задание N2 (Переменные)
homework = 15                                         #Количество выполненных ДЗ
print("Homework:",homework)
numberOfHoursSpent = 5.4                              #Количество затраченных часов
print("NumberOfHoursSpent:",numberOfHoursSpent)
courseName = "Переменные"                             #Название курса
print("CourseName:",courseName)
timeForOneTask = (15/5.4)                             #Время на одно задание
print("TimeForOneTask:",timeForOneTask)
print("Курс:",courseName)
print("Всего задач:",numberOfHoursSpent)
print("Время на одно задание:",timeForOneTask)
